In [1]:
import pandas as pd

In [14]:
data = {'name':['a', 'b', 'c','d','a','c'],'eng':[8,7,5,8,8,5],'hindi':[2,3,4,5,2,4]}

In [15]:
df = pd.DataFrame(data)
df

  name  eng  hindi
0    a    8      2
1    b    7      3
2    c    5      4
3    d    8      5
4    a    8      2
5    c    5      4

In [16]:
df['duplicate'] = df.duplicated()
df

  name  eng  hindi  duplicate
0    a    8      2      False
1    b    7      3      False
2    c    5      4      False
3    d    8      5      False
4    a    8      2       True
5    c    5      4       True

## Drop Dupicates

In [25]:
df.drop_duplicates(inplace = True)

In [26]:
df

  name  eng  hindi  duplicate
0    a    8      2      False
1    b    7      3      False
2    c    5      4      False
3    d    8      5      False
4    a    8      2       True
5    c    5      4       True

In [27]:
dataset = pd.read_csv(r"C:\\Users\\Ankit\\Downloads\\HousingDataSet_2.csv")
dataset.head(4)

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,Married,Gender,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1,No,M,296,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2,Yes,F,242,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2,No,F,242,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3,No,M,222,18.7,394.63,2.94,33.4

In [29]:
dataset.shape

(506, 16)

In [30]:
dataset.drop_duplicates(inplace=True)

In [31]:
dataset.shape

(506, 16)

Row & column same after removing duplicates so no duplicates were present in the data set.